In [1]:
import pandas as pd
import numpy as np

In [2]:
# worker_table = '''Worker_ID,First_Name,Last_Name,Salary,Department
# 1,Monika,Arora,100000,HR
# 2,Niharika,Verma,80000,Admin
# 3,Vishal,Singhal,300000,HR
# 4,Amitabh,Singh,50000,Admin
# 5,Vivek,Bhati,50000,Admin
# 6,Vipul,Diwan,20000,Account
# 7,Satish,Kumar,75000,Account
# 8,Geetika,Chauhan,90000,Admin'''


# with open("worker.csv", "w") as f:
#     f.writelines(worker_table)

In [3]:
# title_table = '''Worker_ID,Worker_title
# 1,Manager
# 2,Executive
# 8,Executive
# 5,Manager
# 4,Asst.Manager
# 7,Executive
# 6,Lead
# 3,Lead'''

# with open("title.csv", "w") as f:
#     f.writelines(title_table)

In [4]:
df = pd.read_csv("worker.csv")
df

   Worker_ID First_Name Last_Name  Salary Department
0          1     Monika     Arora  100000         HR
1          2   Niharika     Verma   80000      Admin
2          3     Vishal   Singhal  300000         HR
3          4    Amitabh     Singh   50000      Admin
4          5      Vivek     Bhati   50000      Admin
5          6      Vipul     Diwan   20000    Account
6          7     Satish     Kumar   75000    Account
7          8    Geetika   Chauhan   90000      Admin

In [5]:
df1 = pd.read_csv("title.csv")
df1

   Worker_ID  Worker_title
0          1       Manager
1          2     Executive
2          8     Executive
3          5       Manager
4          4  Asst.Manager
5          7     Executive
6          6          Lead
7          3          Lead

### Q.1-1 Write a Python code to rank workers according to their salary within each department. 
Give rank 1 to workers having highest salary.

In [6]:
df.groupby(by="Department").max()

            Worker_ID First_Name Last_Name  Salary
Department
Account             7      Vipul     Kumar   75000
Admin               8      Vivek     Verma   90000
HR                  3     Vishal   Singhal  300000

In [7]:
dfs = []
for group, g_df in df.groupby("Department"):
    dfs.append(g_df.sort_values(by="Salary", ascending=False))
    
pd.concat(dfs)

   Worker_ID First_Name Last_Name  Salary Department
6          7     Satish     Kumar   75000    Account
5          6      Vipul     Diwan   20000    Account
7          8    Geetika   Chauhan   90000      Admin
1          2   Niharika     Verma   80000      Admin
3          4    Amitabh     Singh   50000      Admin
4          5      Vivek     Bhati   50000      Admin
2          3     Vishal   Singhal  300000         HR
0          1     Monika     Arora  100000         HR

### Q.1-2 Without Pandas

In [8]:
from collections import namedtuple
from itertools import groupby

worker_table = '''Worker_ID,First_Name,Last_Name,Salary,Department
1,Monika,Arora,100000,HR
2,Niharika,Verma,80000,Admin
3,Vishal,Singhal,300000,HR
4,Amitabh,Singh,50000,Admin
5,Vivek,Bhati,50000,Admin
6,Vipul,Diwan,20000,Account
7,Satish,Kumar,75000,Account
8,Geetika,Chauhan,90000,Admin'''

rows = worker_table.split('\n')
DBRecord = namedtuple('Employee_info', rows[0].replace(' ', '_'))
records = [DBRecord(*row.split(',')) for row in rows[1:]]
records.sort(key=lambda record: (record.Department, -float(record.Salary)))

In [9]:
def Top_salary(N):
    rows = worker_table.split('\n')
    DBRecord = namedtuple('Employee_info', rows[0].replace(' ', '_'))
    records = [DBRecord(*row.split(',')) for row in rows[1:]]
    records.sort(key=lambda record: (record.Department, -float(record.Salary)))
    print('\n\n'.join(
    '\n  '.join([dpt] + [str(g) for g in grp][:N])
        for dpt, grp in groupby(records, lambda record: record.Department)))

In [10]:
Top_salary(1)

Account
  Employee_info(Worker_ID='7', First_Name='Satish', Last_Name='Kumar', Salary='75000', Department='Account')

Admin
  Employee_info(Worker_ID='8', First_Name='Geetika', Last_Name='Chauhan', Salary='90000', Department='Admin')

HR
  Employee_info(Worker_ID='3', First_Name='Vishal', Last_Name='Singhal', Salary='300000', Department='HR')

In [11]:
Top_salary(2)

Account
  Employee_info(Worker_ID='7', First_Name='Satish', Last_Name='Kumar', Salary='75000', Department='Account')
  Employee_info(Worker_ID='6', First_Name='Vipul', Last_Name='Diwan', Salary='20000', Department='Account')

Admin
  Employee_info(Worker_ID='8', First_Name='Geetika', Last_Name='Chauhan', Salary='90000', Department='Admin')
  Employee_info(Worker_ID='2', First_Name='Niharika', Last_Name='Verma', Salary='80000', Department='Admin')

HR
  Employee_info(Worker_ID='3', First_Name='Vishal', Last_Name='Singhal', Salary='300000', Department='HR')
  Employee_info(Worker_ID='1', First_Name='Monika', Last_Name='Arora', Salary='100000', Department='HR')

### Q2. Write a Python function to determine the nth Highest Salary for any department. 
    Function should take nth Salary and department as user input. 
    Function can be called for any value of salary and department.

In [19]:
def dept_nth_salary(dept, n):
    mask = df['Department'] == dept
    salaries = sorted(df[mask]['Salary'], reverse=True)
    return dept, salaries[n-1]

In [21]:
dept_nth_salary('Admin', 1)

('Admin', 90000)

### Q3. Write a Python code to show percentile distribution of salary at overall level.

In [14]:
df['Salary'].describe()

count         8.000000
mean      95625.000000
std       86496.800106
min       20000.000000
25%       50000.000000
50%       77500.000000
75%       92500.000000
max      300000.000000
Name: Salary, dtype: float64

In [15]:
df.Salary.describe()

count         8.000000
mean      95625.000000
std       86496.800106
min       20000.000000
25%       50000.000000
50%       77500.000000
75%       92500.000000
max      300000.000000
Name: Salary, dtype: float64

### Q4. Write a Python code to display all the managers for each department

In [16]:
table = pd.merge(df,df1, on='Worker_ID')
table

   Worker_ID First_Name Last_Name  Salary Department  Worker_title
0          1     Monika     Arora  100000         HR       Manager
1          2   Niharika     Verma   80000      Admin     Executive
2          3     Vishal   Singhal  300000         HR          Lead
3          4    Amitabh     Singh   50000      Admin  Asst.Manager
4          5      Vivek     Bhati   50000      Admin       Manager
5          6      Vipul     Diwan   20000    Account          Lead
6          7     Satish     Kumar   75000    Account     Executive
7          8    Geetika   Chauhan   90000      Admin     Executive

In [17]:
new = table[table['Worker_title'] == 'Manager'].set_index('Department')
new.sort_index(inplace = True)
new

            Worker_ID First_Name Last_Name  Salary Worker_title
Department
Admin               5      Vivek     Bhati   50000      Manager
HR                  1     Monika     Arora  100000      Manager

### Q5. Write a Python code to assign salary_group to each worker.

In [18]:
def label(row):
    if row["Salary"] < 40000:
        return "1"
    elif 40000 < row["Salary"] < 60000:
        return "2"
    else:
        return "3"

df["salary_group"] = df.apply(label, axis=1)
df

   Worker_ID First_Name Last_Name  Salary Department salary_group
0          1     Monika     Arora  100000         HR            3
1          2   Niharika     Verma   80000      Admin            3
2          3     Vishal   Singhal  300000         HR            3
3          4    Amitabh     Singh   50000      Admin            2
4          5      Vivek     Bhati   50000      Admin            2
5          6      Vipul     Diwan   20000    Account            1
6          7     Satish     Kumar   75000    Account            3
7          8    Geetika   Chauhan   90000      Admin            3